iTower_20__GIS_Управление_пространственными_данными/src/Catalogs/гисПоказатели/гисПоказатели.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>гисПоказатели</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ТипЗначения</name>
    <type>
      <types>EnumRef.гисПоказателиТипы</types>
    </type>
  </attributes>
  <attributes>
    <name>СправочникИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СправочникВладелецЗначений</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЗнаков</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.гисПоказателиПериодичность</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СлоиКарты</name>
    <attributes>
      <name>СлойКарты</name>
      <type>
        <types>CatalogRef.гисСлоиКарты</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВсплывающееСообщение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ШаблонРасчета</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Детализация</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЦветаПоказателей</name>
    <attributes>
      <name>КлючСтрокиСлоиКарты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цвет</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеОт</name>
      <type>
        <types>Boolean</types>
        <types>Number</types>
        <types>CatalogRef</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подпись</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

iTower_20__GIS_Управление_пространственными_данными/src/InformationRegisters/гисЗначенияПоказателейОбъектов/гисЗначенияПоказателейОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гисЗначенияПоказателейОбъектов</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЗначениеЧисло</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗначениеБулево</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗначениеСправочник</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.гисОбъектыКарты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.гисПоказатели</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iTower_20__GIS_Управление_пространственными_данными/src/Catalogs/гисОбъектыКарты/гисОбъектыКарты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>гисОбъектыКарты</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Слой</name>
    <type>
      <types>CatalogRef.гисСлоиКарты</types>
    </type>
  </attributes>
  <attributes>
    <name>Широта</name>
    <comment>+ с.ш. / - ю.ш.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>8</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Долгота</name>
    <comment>+ в.д. / - з.д.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>8</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГеометрияWgs</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектУчета</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>НеГеоОбъект</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

iTower_20__GIS_Управление_пространственными_данными/src/Catalogs/гисПоказатели/Forms/ШаблонРасчета/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Детализация Тогда
		Заголовок = "Детализация";
		АвтоЗаголовок = Ложь;
	КонецЕсли;
	
	ШаблонРасчета = Параметры.ШаблонРасчета;
	ЗаполнитьТекстПодсказки();
	
	Если Не Пользователи.ЭтоПолноправныйПользователь(Пользователи.ТекущийПользователь()) Тогда
		Этотобъект.ТолькоПросмотр = Не ПравоДоступа("Изменение", Метаданные.Справочники.гисПоказатели);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПринятьИзменения(Команда)
	Закрыть(ШаблонРасчета);
КонецПроцедуры

&НаКлиенте
Процедура КонструкторЗапроса(Команда)
	Конструктор = Новый КонструкторЗапроса;
	Конструктор.Текст = ШаблонРасчета;
	Конструктор.Показать(Новый ОписаниеОповещения("КонструкторЗапросаЗавершение", ЭтотОбъект));
КонецПроцедуры

&НаКлиенте
Процедура КонструкторЗапросаЗавершение(Текст, дополнительныеПараметры) Экспорт
	Если Текст <> Неопределено Тогда
		ШаблонРасчета = Текст;
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Подсказка(Команда)
	Элементы.Подсказка.Пометка = Не Элементы.Подсказка.Пометка;
	Элементы.ГруппаПодсказка.Видимость = Элементы.Подсказка.Пометка;
КонецПроцедуры

&НаКлиенте
Процедура ПодсказкаОбновить(Команда)
	ЗаполнитьТекстПодсказки();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТекстПодсказки()
	Если Параметры.Детализация Тогда
		ПодсказкаТекст = "Запрос для задания детализации объекта по показателю.
		|
		|Можно использовать параметры (они будут подставлены программно):
		|	Объект - гео-объект, по которому строится тематика;
		|	Дата - дата, на которую строится тематика;
		|	ДатаНачала - дата начала периода для построения тематики;
		|	Показатель - показатель, по которому строится тематика;
		|	Значение - значение объекта по показателю.
		|
		|Все выбранные поля в запросе попадут в отчет.
		|
		|
		|
		|Пример:
		|
		|
		|ВЫБРАТЬ
		|	Родитель, Долгота, Широта
		|ИЗ
		|	Справочник.гисОбъектыКарты
		|ГДЕ
		|	Ссылка = &Объект
		|
		|";
	Иначе
		ПодсказкаТекст = "Запрос для задания значения показателя для объекта.
		|
		|Можно использовать параметры (они будут подставлены программно):
		|	Объект - гео-объект, по которому строится тематика;
		|	Дата - дата, на которую строится тематика;
		|	ДатаНачала - дата начала периода для построения тематики;
		|	Показатель - показатель, по которому строится тематика.
		|
		|Значение показателя должно в запросе иметь синоним ""Значение"".
		|
		|
		|
		|Пример:
		|
		|
		|ВЫБРАТЬ
		|	СУММА(ЗначенияПоказателей.ЗначениеЧисло) КАК Значение
		|ИЗ
		|	РегистрСведений.гисЗначенияПоказателейОбъектов.СрезПоследних(&Дата, Период >= &ДатаНачала И Показатель = &Показатель) КАК ЗначенияПоказателей
		|ГДЕ
		|	ЗначенияПоказателей.Объект.Родитель = &Объект
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗначенияПоказателей.Объект.Родитель
		|";
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
